/* 資工一甲 40618119 施瑞邑*/
/* ex0901 二班期中考分數統計*/ 
#include <stdio.h>
int main() 
{
	int 
	i,j, 		//迴圈 
	enter[i]; 	//輸入 
	float 
	nop[i], 	//人數 
	total[i], 	//總分 
	tag[i], 	//總平均 
	pass[i],	//及格人數 
	age[i], 	//及格百分比 
	nopass[i], 	//不及格人數 
	average[i]; //不及格百分比 
	
	printf("請利用鍵盤連續輸入二班同學該科期中考之成績\n");
	
	for(i=1;i<3;i++) //只有兩班故只需要迴圈兩次 
	{ 
		nop[i]=0;  	 //人數初始值為0 
		total[i]=0;  //總分初始值為0 
		pass[i]=0;   //及格人數初始值為0 
		nopass[i]=0;  //不及格人數初始值為0 */ 
		printf("%s輸入成績(-1為結束)\n",j==1? "資工一甲":"資工一乙"); //顯示班級 
		for(j=1;j<=i;j++)   //一個班級分數的輸入迴圈 
	    {	
			while(enter[j]!=-1)  // 判斷是否跳出 
	        {
	        	scanf("%d",&enter[j]);   	//輸入同學分數 
	        	if(enter[j] != -1)   		//輸入-1等於離開 
			    {		    	
			        nop[j]++;  				//輸入一次人數+1 
					total[j]+=enter[j];   	 //輸入進總分裡 
		            if( enter[j]>=60 && enter[j]<=100 )	//及格統計	
					pass[j]++;			
					else nopass[j]++; //不及格統計   
				}
			}
	    }
	}
	nop[3] = nop[1] + nop[2],  			//全部人數統合 
	total[3] = total[1] + total[2], 	//總共分數統合 
	pass[3] = pass[1] + pass[2], 		//全部及格人數統合
	nopass[3] =nopass[1] + nopass[2];  //全部不及格人數統合
	printf("\t\t\t\t正修科技大學資工系\n\t\t\t\t計算機程式設計(二)\n");
	printf("\t+--------+-----+-----+-------+--------------+--------------+\n");
	printf("\t|班      |修 課|     |   總  |     及 格    |    不 及 格  |\n");
	printf("\t|      級|人 數|總 分|平   均|人 數 百 分 比|人 數 百 分 比|\n");
	for(i=1;i<5;i++)  //顯示參數 
	{
		i%2!=0?   //判斷要排列方式 
		printf("\t+========+=====+=====+=======+==============+==============+\n"):
		printf("\t+--------+-----+-----+-------+--------------+--------------+\n");
		if(i<4)   
		{
			printf("\t|%4s|%5.0f|%5.0f|%7.2f|%3.0f人 %7.1f%%|%3.0f人 %7.1f%%|\n",  
			i==1? "資工一甲" : i==2? "資工一乙" : "合    計",  //判斷顯示字幕 
			nop[i],   				//分別人數顯示 
			total[i],  				//分別總分顯示 
			total[i]/nop[i],		//總平均算式與分別總平均顯示 
			pass[i],                //分別及格人數顯示 
			pass[i]/nop[i]* 100,	//及格百分比運式與及格百分比顯示 
			nopass[i],    //        //分別不及格人數顯示 
			nopass[i]/nop[i] *100 );//不及格百分比運式與不及格百分比顯示 
		}
	}
}
